ChuckM/stm32f4-uart-driver/uart.c
/*
 * Copyright (c) 2013 - Chuck McManis, all rights reserved.
 *
 * A slightly more complex UART/USART driver in order to
 * facilitate multiple character streams. When debugging
 * this example I found it useful to have a couple of
 * streams going. Note that debugging it under GDB is problematic
 * as GDB (at least in SWD mode) doesn't seem to allow interrupts
 * to happen while it is running.
 */
#include <stdint.h>
#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/cm3/nvic.h>
#include "uart.h"
#include "clock.h"
#include "debug.h"

#ifndef NULL
#define NULL (char *)(0)
#endif

/* Until libopencm3 gets defines for the STM32F42[79] which have
 * two additional UARTS
 */

#ifndef UART7
#include "stm32f42x_uart.h"
#endif

/* This defines how many channels we can have configured/opened at once */
#ifndef MAX_UART_CHANNELS
#define MAX_UART_CHANNELS 2
#endif

/* These are the attributes we can fetch with pin_map() */
enum PIN_ATTRIBUTE {
    USART, APB_REG, APB_ENA, BIT, GPIO_ENA, IRQ, AF, GPIO
};

/*
 * Forward Prototypes
 */
static void common_usart_isr(uint32_t, int);

/* This function is at the bottom of the file which helps map info from the PIN
 * to the various constants needed by the initialization function.
 */
static uint32_t uart_pin_map(enum UART_PORT_PIN pin, enum PIN_ATTRIBUTE attr);

/*
 * We hold buffers for all possible ports that can
 * consume more ram than you would like, if so feel
 * free to change this define. Recommend you keep it at
 * least at 16 though.
 */
#define UART_BUF_SIZE    32

static volatile char recv_buf[MAX_UART_CHANNELS][UART_BUF_SIZE];
static volatile char xmit_buf[MAX_UART_CHANNELS][UART_BUF_SIZE];
static volatile uint16_t nxt_recv_ndx[MAX_UART_CHANNELS];
static volatile uint16_t cur_recv_ndx[MAX_UART_CHANNELS];
static volatile uint16_t nxt_xmit_ndx[MAX_UART_CHANNELS];
static volatile uint16_t cur_xmit_ndx[MAX_UART_CHANNELS];

#define NUARTS  8   // Total possible uarts;

/* This maps each UART to the channel it was assigned to */
static int uart_to_channel_map[NUARTS];
/* This maps each channel to the UART serving it */
static int channel_to_uart_map[MAX_UART_CHANNELS];

/* This is the order of UARTs in the uart_to_channel_map */
static const uint32_t UART_MAP[] = {
    USART1,
    USART2,
    USART3,
    UART4,
    UART5,
    USART6,
    UART7,
    UART8
};

/*
 * Common USART/UART transmit and receive interrupts are
 * collated to here. Each serial port simply redirects to here
 * while passing in its BASE address in peripheral space and the
 * channel # it has been assigned. The channel number mapping is
 * established at initialization time.
 */
void
common_usart_isr(uint32_t usart, int channel) {
    if (USART_SR(usart) & USART_SR_RXNE) {
        recv_buf[channel][nxt_recv_ndx[channel]] = USART_DR(usart);
        nxt_recv_ndx[channel] = (nxt_recv_ndx[channel] + 1) % UART_BUF_SIZE;
    }
    if (USART_SR(usart) & USART_SR_TXE) {
        if (nxt_xmit_ndx[channel] == cur_xmit_ndx[channel]) {
            usart_disable_tx_interrupt(usart);  // nothing to send
        } else {
            USART_DR(usart) = xmit_buf[channel][cur_xmit_ndx[channel]];
            cur_xmit_ndx[channel] = (cur_xmit_ndx[channel] + 1) % UART_BUF_SIZE;
        }
    }
}

/* Individual ISR's for the serial ports just redirect */
void usart1_isr() {
    common_usart_isr(USART1, uart_to_channel_map[0]);
}

void usart2_isr() {
    common_usart_isr(USART2, uart_to_channel_map[1]);
}

void usart3_isr() {
    common_usart_isr(USART3, uart_to_channel_map[2]);
}

void uart4_isr() {
    common_usart_isr(UART4_BASE, uart_to_channel_map[3]);
}

void uart5_isr() {
    common_usart_isr(UART5_BASE, uart_to_channel_map[4]);
}

void usart6_isr() {
    common_usart_isr(USART6, uart_to_channel_map[5]);
}

void uart7_isr() {
    common_usart_isr(UART7, uart_to_channel_map[6]);
}

void uart8_isr() {
    common_usart_isr(UART8, uart_to_channel_map[7]);
}

/* Next available channel to configure */
static int nxt_channel = 0;

/*
 * uart_init(tx pin, rx pin, baudrate);
 *
 * Initialize a UART that will talk on the tx/rx pin pair at a given baudrate
 * Curently only 8n1 format, no-hw flow control, only.
 *
 * Returns channel unumber (0 - MAX_UART_CHANNELS) or -1 on error
 */
int
uart_init(enum UART_PORT_PIN tx, enum UART_PORT_PIN rx, int baudrate) {
    uint32_t my_uart = uart_pin_map(tx, USART);
    int i;

    if (uart_pin_map(rx, USART) != my_uart) {
        /* Both pins are not connected to same serial port */
        return -1;
    }
    if (nxt_channel >= MAX_UART_CHANNELS) {
        /* Need more channel configured */
        return -2;
    }

    /* Enable Clock for the USART/UART involved */
    rcc_peripheral_enable_clock((uint32_t *)uart_pin_map(tx, APB_REG),
                                uart_pin_map(tx, APB_ENA));

    /* Enable Clock for the GPIOs we are using */
    rcc_peripheral_enable_clock(&RCC_AHB1ENR, uart_pin_map(tx, GPIO_ENA));
    if (uart_pin_map(rx,GPIO_ENA) != uart_pin_map(tx,GPIO_ENA)) {
        rcc_peripheral_enable_clock(&RCC_AHB1ENR, uart_pin_map(rx, GPIO_ENA));
    }

    /* GPIO pins */

    /* Both AF Mode */
    gpio_mode_setup(uart_pin_map(tx, GPIO), GPIO_MODE_AF, GPIO_PUPD_NONE,
                                            uart_pin_map(tx, BIT));
    gpio_mode_setup(uart_pin_map(rx, GPIO), GPIO_MODE_AF, GPIO_PUPD_NONE,
                                            uart_pin_map(rx, BIT));
    gpio_set_af(uart_pin_map(tx, GPIO),
                uart_pin_map(tx, AF),
                uart_pin_map(tx, BIT));

    gpio_set_af(uart_pin_map(rx, GPIO),
                uart_pin_map(rx, AF),
                uart_pin_map(rx, BIT));

    /* Transmit pin set to an output */
    gpio_set_output_options(uart_pin_map(tx, GPIO), GPIO_OTYPE_PP,
        GPIO_OSPEED_25MHZ, uart_pin_map(tx, BIT));


    /* Set up UART parameters */
    usart_set_baudrate(my_uart, baudrate);
    usart_set_databits(my_uart, 8);
    usart_set_stopbits(my_uart, USART_STOPBITS_1);
    usart_set_mode(my_uart, USART_MODE_TX_RX);
    usart_set_parity(my_uart, USART_PARITY_NONE);
    usart_set_flow_control(my_uart, USART_FLOWCONTROL_NONE);
    usart_enable(my_uart);

    nxt_recv_ndx[nxt_channel] = cur_recv_ndx[nxt_channel] = 0;
    nxt_xmit_ndx[nxt_channel] = cur_xmit_ndx[nxt_channel] = 0;
    /*
     * This was done to try to get it to run under GDB with the Black
     * Magic debug probe but it didn't have any effect (interrupts
     * are still masked)
     */
    nvic_set_priority(uart_pin_map(tx, IRQ), 0); // highest priority
    nvic_enable_irq(uart_pin_map(tx, IRQ));
    USART_DR(my_uart) = 0;
    usart_enable_rx_interrupt(my_uart);

    /* Now create two mappings, channel => usart, and usart => channel */
    channel_to_uart_map[nxt_channel] = my_uart;
    for (i = 0; i < NUARTS; i++) {
        if (UART_MAP[i] == my_uart) {
            uart_to_channel_map[i] = nxt_channel;
            break;
        }
    }
    nxt_channel++;
    return (nxt_channel - 1);
}

