ChuckM/stm32f4-uart-driver/uart.c
/*
 * pin_map
 *
 * This code encodes the relationship between pins and various chip
 * registers, the USART, the AHB bus, the Alternate function code,
 * Etc. Call it with a pin and an attribute and get back an answer.
 *
 * See the UART initialization code for an example of its use.
 */
static uint32_t
uart_pin_map(enum UART_PORT_PIN pin, enum PIN_ATTRIBUTE attr) {
    switch (attr) {
        case USART:
            return pin_uart_attr(pin, 0);
        case APB_ENA:
            return pin_uart_attr(pin, 1);
        case APB_REG:
            return pin_uart_attr(pin, 2);
        case IRQ:
            return pin_uart_attr(pin, 3);
        case BIT:
            return pin_to_bit(pin);
        case GPIO_ENA:
            return pin_to_enable(pin);
        case AF:
            return pin_to_af(pin);
        default:
            return pin_to_gpio(pin);
    }
}

/*
 * Convert a number to a string in the desired
 * base.
 *
 * Assumes:
 *      - buf has enough space (up to 33 bytes for
 *        a 32 bit number in binary)
 * Verifies:
 *      - base is one of 2, 8, 10, or 16
 * Creates:
 *      - null string on error ("")
 *
 *                                d
 *                                V
 *       [ ] [6] [5] [4] [3] [2] [1] 
 *        ^
 *       buf
 *
 *       do {
 *          *b ^= *d;
 *          *d ^= *b;
 *          *b ^= *d;
 *       } while (++b < --d);
 *
 *      buf must have 35 bytes behind it, worst case!
 */
void
ntoa(uint32_t val, uint16_t fmt, char *buf) {
    char *d;
    int base, width;
    int sign_bit = 0;

    d = buf;
    *d = '\000';
    d++;
    width = fmt & FMT_WIDTH_MASK;
    base = 10;
    if ((fmt & (FMT_SIGNED | FMT_BASE_MASK)) == (FMT_SIGNED | FMT_BASE_10)) {
        sign_bit = ((val & 0x80000000) != 0);
        val = (val & 0x80000000) ? -val : val;
    }
    switch (fmt & FMT_BASE_MASK) {
        case FMT_BASE_2:
            base = 2;
            if (fmt & FMT_ALTERNATE_FORM) {
                width = width - 2;
            }
            break;
        case FMT_BASE_8:
            base = 8;
            if (fmt & FMT_ALTERNATE_FORM) {
                width = width - 1;
            }
            break;
        case FMT_BASE_16:
            base = 16;
            if (fmt & FMT_ALTERNATE_FORM) {
                width = width - 2;
            }
            break;
        case FMT_BASE_10:
            base = 10;
            if (fmt & FMT_ALTERNATE_FORM) {
                *d++ = '0';
                *d++ = '.';
                width = width - 2;
            }
            break;
    }

    if (val == 0) {
        *d++ = '0';
    } else {
        while (val > 0) {
            *d++ = ((val % base) < 10) ? (val % base) + '0' :
                                                 (val % base) + '7';
            val /= base;
            width--;
        }
    }

    if (fmt & FMT_LEADING_ZERO) {
        while (width > 0) {
            *d++ = '0';
            width--;
        }
    }
    if (fmt & FMT_ALTERNATE_FORM) {
        switch (fmt & FMT_BASE_MASK) {
            case FMT_BASE_16:
                *d++ = 'x';
                *d++ = '0';
                break;
            case FMT_BASE_8:
                *d++ = '0';
                break;
            case FMT_BASE_2:
                *d++ = 'b';
                *d++ = '0';
            default:
                break;
        }
    }
    if (sign_bit) {
        *d++ = '-';
        width--;
    }

    if ((width > 0) && ((FMT_LEFT_ADJUST & fmt) == 0)) {
        while (width) {
            *d++ = ' ';
            width--;
        }
    }
    /*
     * So how often do you get to use an interview question in your
     * code? 
     * At this point the string is in buf, only backwards so reverse it
     * in place.
     */
    d--;    // Point d at last character
    do {
        *d ^= *buf;
        *buf ^= *d;
        *d ^= *buf;
    } while (++buf < --d);
    if ((width > 0) && ((FMT_LEFT_ADJUST & fmt) != 0)) {
        while (*d != '\000') {
            d++;
        }
        while (width) {
            *d++ = ' ';
            width--;
        }
        *d = '\000';
    }
    return;
}
/*
 * Convert a string to a number in the desired
 * 
 * Assumes:
 *      - buf has enough space (up to 33 bytes for
 *        a 32 bit number in binary)
 *      - Stops at first non-legal digit in specified
 *        base or NUL character.
 * Verifies:
 *      - base is one of 2, 8, 10, or 16 (no octal)
 * Returns:
 *      - 0 even on failure.
 */
uint32_t
aton(char *buf, int base) {
    uint32_t res;
    uint8_t digit;

    res = 0;
    if ((base != 2) && (base != 8) && (base != 10) && (base != 16)) {
        return 0;
    }
    while (*buf != '\000') {
        digit = (*buf > '9') ? (*buf - '7') : (*buf - '0');
        if (((base == 2) && (digit > 1)) ||
            ((base == 8) && (digit > 7)) ||
            ((base == 10) && (digit > 9)) ||
            ((base == 16) && (digit > 15))) {
            return res;
        }
        res *= base;
        res += digit;
        buf++;
    }
    return res;
}


/*
 * Print a number given various formatting options.
 * NB: No floating point yet. 
 *
 * This got a bit out of hand but I wanted just *one* number printing
 * function rather than several. 
 *
 * Notes from my notebook:
 * Number consists of:
 *
 *      PREFIX|NUMBER|SUFFIX
 *     |------ width -------|
 *     |------ field width -----|

 * Prefix is one of "", "-", "0x", "0b", "0", "-0x" "-0b", "-0"
 * Suffix is one of "", ".0"
 *
 * The independent variable is the leading zero question.
 * So when LEADING ZERO is set you pad the width of Number to fill
 * the width, up to 32 bits of precision.
 *
 * With LEFT adjust you pad right, without it you pad left.
 *
 * Examples:
 *   0x12345000 - hex + alternate form
 *     1234abcd - just hex 
 *           0C - hex + width of 2 + leading 0
 *         10.0 - decimal + alternate form
 *      0b11011 - Binary + alternate form
 *   0b00011011 - Binary + alternate form + leading 0 + 8 digits
 *   123        - Decimal + left adjust + width of 10
 *          010 - octal
 * 037777777777 - octal equivalent of -1
 *         -1.0 - decimal + sign + alternate form (adds the .0)
 *
 */
void
uart_putnum(int chan, uint16_t fmt, uint32_t num) {
    char buf[48];

    ntoa(num, fmt, buf);
    uart_puts(chan, buf);
    if (fmt & FMT_NEWLINE) {
        uart_puts(chan, "\n");
    }
}
